{
  "languaje": {
    "en": "English",
    "es": "Spanish"
  },
  "header": {
    "contribute": "Contribute",
    "blog": "Blog",
    "v": "v"
  },
  "sidebar": {
    "Title": "Documentation",
    "T-getting": "Getting Started",
    "N-introduction": "Introduction",
    "N-install": "Installation",
    "N-usage": "Usage",
    "N-contribute": "Contribute",

    "T-components": "Components",
    "ST-blog": "Blog",
    "N-OnixBlogv1": "OnixBlog v1",

    "ST-portfolio": "Portfolio",
    "N-onixPortfolioV1": "OnixPortfolio v1",

    "ST-ecommerce": "E-commerce",
    "N-onixEcommerceV1": "OnixEcommerce v1",

    "ST-landingPage": "Landing Page",
    "N-onixLandingPageV1": "OnixLandingPage v1",

    "T-customization": "Customization",
    "N-children": "Using Children",
    "N-props": "Using Props",
    "N-styling": "Using Styling",

    "T-useCases": "Use Cases",
    "N-blogs": "Blogs and Articles",
    "N-portfolios": "Creative Portfolios",
    "N-ecommerces": "E-commerce Systems"
  },
  "main": {
    "title": "Create websites quickly, fully customizable without breaking the structure or adaptability",
    "subtitle1": "With FrameOnix, you get fully customizable layouts in React, perfect for developers who want fast results without losing control. Create responsive websites with just a few Props. Examples of our components include",
    "subtitle2": "for a modern blog or",
    "subtitle3": "for a beautiful and dynamic portfolio page. ¡Just import and customize!",
    "btn": "Get Started"
  },

  "intro": {
    "T-p1": "FrameOnix is ​​the ideal solution for developers who want to boost their web projects with creativity and efficiency. This library gives you the ability to customize each component to your specific needs, allowing you to bring to life unique designs that combine modernity and functionality. Whether you work on small projects or complex applications, FrameOnix is ​​designed to facilitate your workflow, saving you time without compromising technical quality.",
    "T-p2": "With innovative tools and an intuitive interface, FrameOnix makes building web interfaces a flexible and agile experience. Its focus on simplicity not only encourages creativity, but also ensures professional results at every stage of development. This library has been created with developers of all levels in mind, offering clear documentation and practical examples so you can take full advantage of its potential.",

    "subtitle1": "¿What is FrameOnix?",
    "S-p1": "FrameOnix is ​​a React-based solution that offers components designed to represent the complete layout of different types of web pages. Instead of working with individual sections, each FrameOnix component includes the entire structure of a specific design, such as a blog, portfolio, online store, and more.",
    "S-p2": "Each component is internally divided into sections (such as headers, main areas, footers, etc.), allowing full customization of styles and content while maintaining structural consistency of the design.",
    "S-p3": "Additionally, as an open source project, FrameOnix is ​​constantly evolving thanks to the collaboration of its community. You can also contribute your ideas, improvements and new features to make it even more useful for everyone!",

    "subtitle2": "¿Why choose FrameOnix?",
    "S2-p1": "FrameOnix is ​​designed to be versatile and accessible to any type of developer or designer. Some reasons to use this tool include:",

    "2li-title1": "Complete customization:",
    "2li-p1": "Change styles, texts and images of each section easily with Props and children.",
    "2li-title2": "Open Source:",
    "2li-p2": "As an open source project, FrameOnix gives you the freedom to adapt and contribute to the growth of the tool.",
    "2li-title3": "Modular design:",
    "2li-p3": "Each component is intended to be reusable and flexible, allowing you to quickly integrate your ideas without compromising the structure of the design.",
    "2li-title4": "Efficiency:",
    "2li-p4": "With FrameOnix you can reduce the time spent designing interfaces and focus on what really matters: the content.",

    "subtitle3": "¿Who is FrameOnix for?",
    "S3-p1": "FrameOnix is ​​designed for everyone, but is especially useful for:",
    "3li-title1": "Freelancers:",
    "3li-p1": "Who are looking for designs that are easy to modify to deliver fast and personalized results to their clients.",
    "3li-title2": "Backend developers:",
    "3li-p2": "Who want to create functional and aesthetic pages without having to learn design from scratch.",
    "3li-title3": "Web design apprentices:",
    "3li-p3": "Who still don't know how to start a design from scratch and need a solid and simple base to work from.",

    "subtitle4": "¿What will you find in this documentation?",
    "4li-p1": "A guide to installing and configuring FrameOnix.",
    "4li-p2": "Practical examples of how to use its main Props: id, styles, content and children.",
    "4li-p3": "A section dedicated to each component, detailing how to modify its layouts and content effectively.",
    "4li-p4": "Instructions on how to contribute to the development of the project.",

    "subtitle5": "An Open Source Project",
    "5sub-p1": "As an open-source project, FrameOnix invites the community to participate in its development. Whether it's fixing bugs, suggesting new functionality, or improving documentation, every contribution is valuable.",
    "5sub-p2": "If you would like to contribute, visit the Contributing section for a step-by-step guide on how you can contribute to the project. Your participation not only helps improve FrameOnix, but also contributes to a tool that hundreds of people in the community will be able to use.",

    "nota1": "¡Come on, get started and discover everything you can achieve with this easy-to-use library! What are you waiting for? Go to the Installation section and start your design adventure right now!"
  },

  "install": {
    "title": "Get Started with FrameOnix",
    "T-p1": "FrameOnix offers you fully customizable layouts in React. It works by importing predefined components that maintain a solid and adaptive structure, allowing you to modify styles and content effortlessly using Children and Props.",
    "T-p2": "It is intuitive, adaptable, and efficient, designed for developers seeking to build amazing websites with ease and speed.",

    "important": "Important!",
    "Import-p1": "Before installing FrameOnix, make sure you have",
    "Import-p2": "installed on your system and updated to its latest version. This is required to use",
    "Import-p3": "which will handle the installation and setup of the library. You can check your current version by running",
    "Import-p4": "in your terminal. If you don’t have it installed, download it from",

    "Step-1_title": "Install FrameOnix",
    "Step-1_p1": "Install",
    "Step-1_p2": "through npm",
    "Step-2_title": "Install Tailwind CSS",
    "Step-2_p1": "Install",
    "Step-2_p2": "via npm and then run the init command to generate its file.",
    "Step-3_title": "Configure the template paths",
    "Step-3_p1": "Add the paths of all template files in your",
    "Step-3_p2": "file.",
    "Step-4_title": "Add the Tailwind directives to your CSS",
    "Step-4_p1": "Add the",
    "Step-4_p2": "directives for each of the Tailwind layers to your index CSS file.",
    "Step-5_title": "Start using FrameOnix in your project",
    "Step-5_p1": "Start using FrameOnix components to style and modify your content.",
    "Step-6_title": "Start your build process",
    "Step-6_p1": "Run your development process with"
  },

  "usage": {
    "title": "FrameOnix usage",
    "T-p1": "With Frameonix, you can modify the styles, texts and images of each section of the layout with simple accessories. If you want more control, you can also completely replace specific sections using children, always maintaining the structure and adaptability of the layout.",

    "Step-1_title": "General Use",
    "Step-1_p1": "To start using Frameonix, import the desired component into your React project and customize it to your needs. Each component has intuitive and documented props to modify its behavior, styles and content.",

    "import1_title": "Simplifying the Customization of your Designs",
    "import1_p1": "With a compact structure and designed to make work easier, Frameonix makes working with props intuitive and not overwhelming, even for those who are just starting out in web development.",
    "import1_p2": "Each",
    "import1_span1": "Section",
    "import1_p3": "of a component is designed to be customizable through",
    "import1_span2": "4 Props",
    "import1_p4": "main ones, applicable to all its sections:",

    "Step-2-title": "ID",
    "Step-2_p1": "Assigns a unique identifier for each section that is part of a FrameOnix component, useful for internal navigations such as in a navbar.",
    "Nota1": "Please note that the IDs must match the names assigned in the navbar to work correctly.",

    "Step-3-title": "STYLES",
    "Step-3-p1": "The styles object is designed to make it easy to customize CSS styles in a precise and structured way. It allows you to modify each section of a component with full control, while maintaining the structure of the overall design.",
    "Step-3-subT": "¿How does it work?",
    "Step-3-p2": "Each key within the styles object represents a specific part of the section, such as the background, titles, buttons, or other visual elements. The values ​​are the CSS classes or styles that will be applied to those keys. This allows you to adjust the styles without touching the internal code of the component.",

    "Step-4-title": "CONTENT",
    "Step-4-p1": "The content object is designed to allow you to precisely and efficiently change the key elements of a section, such as texts, images or links. This makes customization easy without compromising the design structure",
    "Step-4-subT": "¿How does it work?",
    "Step-4-p2": "Each key within the content object is linked to a specific element in the section. By modifying the values, you can update the visual content without needing to alter the component code directly.",

    "nota-2": "Each component has specific documentation in the Components section of this page. There you will find all available properties, detailed examples and best practices to get the most out of Frameonix.",

    "Step-5-title": "CHILDREN",
    "Step-5-p1": "The children property is designed to give you full control over a specific section of a component. It allows you to completely replace the default content of that section with your own design and custom elements, maintaining the general structure of the layout.",
    "Step-5-subT": "¿How does it work?",
    "Step-5-p2": "When you use children, the corresponding section no longer depends on the default properties",
    "Step-5-p3": "and is rendered exclusively with the elements you define within children. This gives you the freedom to design that part according to your needs, without restrictions.",

    "text-footer": "With this structure, Frameonix ensures that you have full control without losing simplicity. Start customizing and create amazing pages with ease!"
  },
  "onixBlogv1": {
    "title": "¡Get to know OnixBlogv1!",
    "T-description": "This component offers you a complete and customizable structure for your website, allowing you to configure key elements such as headers, main content, posts, articles, contact sections, and much more, through intuitive plugins. Each accessory is documented in detail along with an example of its use so you can make the most of its potential and adapt the design to your needs with ease.",
    "info1": "From this section onwards, props will not be mentioned",
    "info2": "The prop (id) is only necessary if you change the content of the header, and (children) is only used to replace the content while maintaining the base structure. To avoid redundancies, we will not include them in the following explanations.",
    "_subtitle1": "Description:",
    "_subtitle2": "Example:",

    "header-id": "This 'id' is used to construct the path to which you are redirected when clicking on the header logo.",
    "header-content_img": "URL of the image used as the logo in the header.",
    "header-content_nav": "Array with the names of the navbar sections. Make sure you assign the same IDs to the corresponding sections: (title), (path)",
    "header-styles_header": "Defines the custom styles for the main header container.",
    "header-styles_containerImg": "Styles applied to the header logo container.",
    "header-styles_img": "Styles applied to the logo image.",
    "header-styles_nav": "Defines the styles for the navigation container (navigation bar).",
    "header-styles_button": "Customizes the styles for the mobile menu buttons (open/close).",
    "header-styles_ul": "Defines the styles for the <ul> list that contains the navigation links.",
    "header-styles_li": "Customizes the styles for each <li> list item (the links).",
    "header-styles_menuDestok": "Defines the styles for the desktop menu container.",
    "header-styles_containerButtons": "Styles applied to the container for the mobile navigation buttons.",
    "header-styles_menuMobile": "Defines the styles for the mobile dropdown menu.",
    "header-children": "Use the (children) property if you need to completely customize the (header) content. This will reset the content, but maintain base styles to preserve the overall structure.",

    "main-content_title": "Defines the text of the main title to be displayed in the component.",
    "main-content_description": "Defines the descriptive text to be displayed below the title.",
    "main-content_path": "Defines the link to which the action button will redirect.",
    "main-content_button": "Defines the text to be displayed on the action button.",
    "main-content_video": "Defines an 'embed' URL to display a video in the section.",
    "main-content_img": "Defines the URL of the image to be displayed in the media container.",
    "main-styles_main": "Defines custom styles for the main container of the component.",
    "main-styles_containerDescription": "Defines custom styles for the description container.",
    "main-styles_title": "Defines custom styles for the main title of the component.",
    "main-styles_description": "Defines custom styles for the description paragraph.",
    "main-styles_button": "Defines custom styles for the action button.",
    "main-styles_containerMedia": "Defines custom styles for the media container (image or video).",
    "main-styles_video": "Defines specific styles for the video option.",
    "main-styles_img": "Defines specific styles for the image option.",

    "posts-content_title": "Defines the main title displayed in the posts section.",
    "posts-content_posts": "Must contain more than one object to render. It is an array of objects representing the card content. Each object can include the following properties: (img), (title), (description), (path), (namePath).",
    "posts-styles_posts": "Defines the custom styles for the main container wrapping the posts.",
    "posts-styles_title": "Custom styles for the main title of the component.",
    "posts-styles_grid": "Allows customization of the grid styles organizing the post cards.",
    "posts-styles_card": "Applies custom styles to each individual post card.",
    "posts-styles-img": "Custom styles for the images inside the cards.",
    "posts-styles-_title": "Defines the styles for the titles of each card (post).",
    "posts-styles-description": "Custom styles for the post descriptions.",
    "posts-styles-path": "Allows customization of the styles for the link in each card.",

    "about-content_title": "Defines the text to be displayed as the section's title.",
    "about-content_paragraphs": "An array of objects, where each object contains a property (p) that defines the text of a paragraph in the section.",
    "about-content_img": "Defines the URL of the image to be displayed in the section.",
    "about-styles_section": "Defines the custom styles for the main container of the section.",
    "about-styles_containerDescription": "Defines the custom styles for the container that holds the title and descriptive paragraphs.",
    "about-styles_title": "Defines the custom styles for the section's title.",
    "about-styles_p": "Defines the custom styles for the paragraphs within the section.",
    "about-styles_img": "Defines the custom styles for the image within the section.",

    "article-content_title": "Defines the text for the main subtitle of the section.",
    "article-content_img": "Provides the URL for the background image displayed in the image section.",
    "article-content_h3": "Specifies the title of the article that appears within the section.",
    "article-content_description": "Provides the descriptive content of the article.",
    "article-styles_article": "Applies custom styles to the main container of the section.",
    "article-styles_containerDescription": "Defines the styles for the description container.",
    "article-styles_title": "Applies styles to the main subtitle of the section.",
    "article-styles_img": "Customizes the styles of the background image container.",
    "article-styles_containerArticle": "Styles the container for the articles within the section.",
    "article-styles_h3": "Applies custom styles to the article title.",
    "article-styles_description": "Applies styles to the article's descriptive text.",

    "contact-content_title": "Text that appears as the main title of the section.",
    "contact-content_icons": "Array of custom icons that includes the properties (icon) and (path).",
    "contact-content_facebook": "URL for the Facebook icon.",
    "contact-content_instagram": "URL for the Instagram icon.",
    "contact-content_github": "URL for the GitHub icon.",
    "contact-content_twitter": "URL for the Twitter icon.",
    "contact-content_h3": "Subtitle that appears in the contact form.",
    "contact-content_placeholderA": "Placeholder for the name input field.",
    "contact-content_placeholderB": "Placeholder for the message text field.",
    "contact-content_button": "Text for the submit button in the form.",
    "contact-styles_contact": "Defines the custom styles for the main container of the contact section.",
    "contact-styles_containerContent": "Applies custom styles to the container grouping the main content elements (form and icon section).",
    "contact-styles_title": "Customizes the main section title that displays the header.",
    "contact-styles_containerIcons": "Applies custom styles to the container of the social icons.",
    "contact-styles_icon": "Defines custom styles for each individual icon.",
    "contact-styles_form": "Customizes the styles of the contact form.",
    "contact-styles_h3": "Applies custom styles to the form subtitle.",
    "contact-styles_input": "Defines the styles for the form input fields.",
    "contact-styles_textArea": "Applies custom styles to the message text area.",
    "contact-styles_button": "Customizes the styles for the form submit button.",

    "footer-content_description": "Contains the text displayed in the footer. If not defined, a default text will be used.",
    "footer-content_img": "Contains the URL of the image displayed in the footer. If not defined, a default image will be used.",
    "footer-styles_footer": "Defines the custom styles for the main footer container.",
    "footer-styles_containerDescription": "Defines the custom styles for the container that holds the text and image.",
    "footer-styles_description": "Defines the custom styles for the text within the footer.",
    "footer-styles_img": "Defines the custom styles for the footer image."
  }
}
