{
  "languaje": {
    "en": "Ingles",
    "es": "Español"
  },

  "header": {
    "contribute": "Contribuir",
    "blog": "Blog",
    "v": "v"
  },

  "sidebar": {
    "Title": "Documentacion",
    "T-getting": "Empezando",
    "N-introduction": "Introduccion",
    "N-install": "Instalacion",
    "N-usage": "Uso",
    "N-contribute": "Contribuir",

    "T-components": "Componentes",
    "ST-blog": "Blog",
    "N-OnixBlogv1": "OnixBlog v1",

    "ST-portfolio": "Portafolios",
    "N-onixPortfolioV1": "OnixPortfolio v1",

    "ST-ecommerce": "E-commerce",
    "N-onixEcommerceV1": "OnixEcommerce v1",

    "ST-landingPage": "Pagina de aterrizaje",
    "N-onixLandingPageV1": "OnixLandingPage v1",

    "T-customization": "Personalizacion",
    "N-children": "Uso de Hijos",
    "N-props": "Uso de Props",
    "N-styling": "Uso de Estilos",

    "T-useCases": "Casos de uso",
    "N-blogs": "Blogs y Articulos",
    "N-portfolios": "Portafolios Creativos",
    "N-ecommerces": "Sistemas de E-commerce"
  },

  "main": {
    "title": "Cree sitios web rápidamente, totalmente personalizables sin romper la estructura ni la adaptabilidad",
    "subtitle1": "Con FrameOnix, obtienes layouts completamente personalizables en React, perfectos para desarrolladores que quieren resultados rápidos sin perder control. Crea sitios web responsivos con solo unas Props. Ejemplos de nuestros componentes incluyen",
    "subtitle2": "para un blog moderno o",
    "subtitle3": "para una página de portafolio hermoso y dinámico. ¡Solo importa y personaliza!",
    "btn": "Empezar"
  },

  "intro": {
    "T-p1": "FrameOnix es la solución ideal para desarrolladores que desean potenciar sus proyectos web con creatividad y eficiencia. Esta biblioteca te brinda la capacidad de personalizar cada componente según tus necesidades específicas, permitiéndote dar vida a diseños únicos que combinan modernidad y funcionalidad. Ya sea que trabajes en proyectos pequeños o aplicaciones complejas, FrameOnix está diseñada para facilitar tu flujo de trabajo, ahorrándote tiempo sin comprometer la calidad técnica.",
    "T-p2": "Con herramientas innovadoras y una interfaz intuitiva, FrameOnix convierte la construcción de interfaces web en una experiencia ágil y flexible. Su enfoque en la simplicidad no solo fomenta la creatividad, sino que también garantiza resultados profesionales en cada etapa del desarrollo. Esta biblioteca ha sido creada pensando en desarrolladores de todos los niveles, ofreciendo documentación clara y ejemplos prácticos para que puedas aprovechar al máximo su potencial.",

    "subtitle1": "¿Qué es FrameOnix?",
    "S-p1": "FrameOnix es una solución basada en React que ofrece componentes diseñados para representar el layout completo de diferentes tipos de páginas web. En lugar de trabajar con secciones individuales, cada componente de FrameOnix incluye la estructura completa de un diseño específico, como un blog, un portafolio, una tienda en línea, entre otros.",
    "S-p2": "Cada componente está dividido internamente en secciones (como encabezados, áreas principales, pies de página, etc.), lo que permite una personalización total de estilos y contenido mientras se conserva la coherencia estructural del diseño.",
    "S-p3": "Además, como un proyecto de código abierto, FrameOnix está en constante evolución gracias a la colaboración de su comunidad. ¡Tú también puedes contribuir con tus ideas, mejoras y nuevas funcionalidades para hacerlo aún más útil para todos!",

    "subtitle2": "¿Por qué elegir FrameOnix?",
    "S2-p1": "FrameOnix está diseñado para ser versátil y accesible para cualquier tipo de desarrollador o diseñador. Algunas razones para usar esta herramienta incluyen:",

    "2li-title1": "Personalización completa:",
    "2li-p1": "Cambia estilos, textos e imágenes de cada sección fácilmente con Props y children.",
    "2li-title2": "Open Source:",
    "2li-p2": "Como proyecto de código abierto, FrameOnix te da libertad para adaptarlo y contribuir al crecimiento de la herramienta.",
    "2li-title3": "Diseño modular:",
    "2li-p3": "Cada componente está pensado para ser reutilizable y flexible, permitiéndote integrar rápidamente tus ideas sin comprometer la estructura del diseño.",
    "2li-title4": "Eficiencia:",
    "2li-p4": "Con FrameOnix puedes reducir el tiempo dedicado al diseño de interfaces y concentrarte en lo que realmente importa: el contenido.",

    "subtitle3": "¿Para quién es FrameOnix?",
    "S3-p1": "FrameOnix está diseñado para todos, pero es especialmente útil para:",
    "3li-title1": "Freelancers:",
    "3li-p1": "Que buscan diseños fáciles de modificar para entregar resultados rápidos y personalizados a sus clientes.",
    "3li-title2": "Desarrolladores backend:",
    "3li-p2": "Que quieren crear páginas funcionales y estéticas sin tener que aprender diseño desde cero.",
    "3li-title3": "Aprendices de diseño web:",
    "3li-p3": "Que aún no saben cómo empezar un diseño desde cero y necesitan una base sólida y sencilla para trabajar.",

    "subtitle4": "¿Qué encontrarás en esta documentación?",
    "4li-p1": "Una guía para instalar y configurar FrameOnix.",
    "4li-p2": "Ejemplos prácticos de cómo usar sus Props principales: id, styles, content y children.",
    "4li-p3": "Una sección dedicada a cada componente, donde se detalla cómo modificar sus layouts y contenido de manera efectiva.",
    "4li-p4": "Instrucciones sobre cómo contribuir al desarrollo del proyecto.",

    "subtitle5": "Un Proyecto Open Source",
    "5sub-p1": "Como proyecto open-source, FrameOnix invita a la comunidad a participar en su desarrollo. Ya sea corrigiendo errores, sugiriendo nuevas funcionalidades, o mejorando la documentación, cada contribución es valiosa.",
    "5sub-p2": "Si deseas colaborar, visita la sección Contributing para obtener una guía paso a paso sobre cómo puedes aportar al proyecto. Tu participación no solo ayuda a mejorar FrameOnix, sino que también contribuye a una herramienta que cientos de personas en la comunidad podrán usar.",

    "nota1": "¡Vamos, anímate a usar y descubrir todo lo que puedes lograr con esta librería fácil de usar! ¿Qué esperas? Ve a la sección de Instalación y comienza tu aventura de diseño ahora mismo!"
  },

  "install": {
    "title": "Comience a utilizar FrameOnix",
    "T-p1": "FrameOnix te ofrece layouts completamente personalizables en React. Funciona importando componentes predefinidos que mantienen una estructura sólida y adaptable, permitiéndote modificar estilos y contenido con Children y Props sin complicaciones.",
    "T-p2": "Es intuitivo, adaptable y eficiente, diseñado para desarrolladores que buscan construir sitios web increíbles con facilidad y rapidez.",

    "Import-p1": "Antes de instalar FrameOnix, asegúrate de tener",
    "Import-p2": "instalado en tu sistema y actualizado a su última versión. Esto es necesario para usar",
    "Import-p3": "que manejará la instalación y configuración de la librería. Puedes verificar tu versión actual ejecutando",
    "Import-p4": "en tu terminal. Si no lo tienes instalado, descárgalo desde",

    "Step-1_title": "Instalar FrameOnix",
    "Step-1_p1": "Instale",
    "Step-1_p2": "a través de npm",
    "Step-2_title": "Instalar Tailwind CSS",
    "Step-2_p1": "Instale",
    "Step-2_p2": "mediante npm y luego ejecute el comando init para generar su archivo.",
    "Step-3_title": "Configurar las rutas de las plantillas",
    "Step-3_p1": "Agregue las rutas de todos los archivos de plantilla en su",
    "Step-3_p2": "archivo.",
    "Step-4_title": "Añade las directivas Tailwind a tu CSS",
    "Step-4_p1": "Agregue las",
    "Step-4_p2": "directivas para cada una de las capas de Tailwind a su archivo CSS principal.",
    "Step-5_title": "Comience a utilizar FrameOnix en su proyecto",
    "Step-5_p1": "Comience a utilizar los componentes de FrameOnix para darle estilos y modificar su contenido.",
    "Step-6_title": "Comience su proceso de construcción",
    "Step-6_p1": "Ejecute su proceso de desarrollo con"
  },

  "usage": {
    "title": "Uso de FrameOnix",
    "T-p1": "Con Frameonix, puedes modificar los estilos, textos e imágenes de cada sección del layout con props simples. Si deseas más control, también puedes reemplazar completamente secciones específicas usando children, manteniendo siempre la estructura y adaptabilidad del diseño.",

    "Step-1_title": "Uso General",
    "Step-1_p1": "Para empezar a usar Frameonix, importa el componente deseado en tu proyecto React y personalízalo según tus necesidades. Cada componente tiene props intuitivas y documentadas para modificar su comportamiento, estilos y contenido.",

    "import1_title": "Simplificando la Personalización de tus Diseños",
    "import1_p1": "Con una estructura compacta y pensada para facilitar el trabajo, Frameonix hace que trabajar con props sea intuitivo y nada abrumador, incluso para quienes están empezando en el desarrollo web.",
    "import1_p2": "Cada",
    "import1_span1": "Seccion",
    "import1_p3": "de un componente esta diseñado para ser personalizable mediante",
    "import1_span2": "4 Props",
    "import1_p4": "principales, aplicables a todas sus secciones:",

    "Step-2-title": "ID",
    "Step-2_p1": "Asigna un identificador único para cada sección que hace parte de un componente de FrameOnix, útil para navegaciones internas como en un navbar.",
    "Nota1": "Ten en cuenta que los ID deben coincidir con los nombres asignados en el navbar para funcionar correctamente.",

    "Step-3-title": "STYLES",
    "Step-3-p1": "El objeto styles está diseñado para facilitar la personalización de estilos CSS de manera precisa y estructurada. Te permite modificar cada sección de un componente con un control total, manteniendo la estructura del diseño general.",
    "Step-3-subT": "¿Cómo funciona?",
    "Step-3-p2": "Cada clave dentro del objeto styles representa una parte específica de la sección, como el fondo, títulos, botones u otros elementos visuales. Los valores son las clases o estilos CSS que se aplicarán a esas claves. Esto te permite ajustar los estilos sin tocar el código interno del componente.",

    "Step-4-title": "CONTENT",
    "Step-4-p1": "El objeto content está diseñado para permitirte cambiar de manera precisa y eficiente los elementos clave de una sección, como textos, imágenes o enlaces. Esto hace que la personalización sea sencilla sin comprometer la estructura del diseño",
    "Step-4-subT": "¿Cómo funciona?",
    "Step-4-p2": "Cada clave dentro del objeto content está vinculada a un elemento específico de la sección. Al modificar los valores, puedes actualizar el contenido visual sin necesidad de alterar el código del componente directamente.",

    "nota-2": "Cada componente tiene documentación específica en la sección Components de esta página. Allí encontrarás todas las propiedades disponibles, ejemplos detallados y las mejores prácticas para sacar el máximo provecho de Frameonix.",

    "Step-5-title": "CHILDREN",
    "Step-5-p1": "La propiedad children está diseñada para brindarte un control total sobre una sección específica de un componente. Te permite reemplazar completamente el contenido predeterminado de esa sección con tu propio diseño y elementos personalizados, manteniendo la estructura general del layout.",
    "Step-5-subT": "¿Cómo funciona?",
    "Step-5-p2": "Cuando utilizas children, la sección correspondiente deja de depender de las propiedades predeterminadas",
    "Step-5-p3": "y se renderiza exclusivamente con los elementos que defines dentro de children. Esto te da la libertad de diseñar esa parte según tus necesidades, sin restricciones.",

    "text-footer": "Con esta estructura, Frameonix asegura que tengas control total sin perder simplicidad. ¡Empieza a personalizar y crea páginas increíbles con facilidad!"
  },

  "onixBlogv1": {
    "title": "¡Conoce OnixBlogv1!",
    "T-description": "Este componente te ofrece una estructura completa y personalizable para tu sitio web, permitiéndote configurar elementos clave como encabezados, contenido principal, publicaciones, artículos, secciones de contacto, y mucho más, a través de props intuitivas Cada prop está documentada en detalle junto a un ejemplo de su uso para que puedas aprovechar al máximo su potencial y adaptar el diseño a tus necesidades con facilidad.",
    "info1": "A partir de esta sección, no se mencionarán las props ",
    "info2": "El prop (id) solo es necesario si cambias el contenido del header, y (children) sirve únicamente para reemplazar el contenido manteniendo la estructura base. Para evitar redundancias, no las incluiremos en las siguientes explicaciones.",
    "header-id": "Este 'id' se utiliza para construir el path al que se redirige al hacer click en el logo del header.",
    "header-content_img": "Ruta del logo mostrado en el header.",
    "header-content_nav": "Array con los nombres de las secciones de la navbar. Asegúrate de asignar los mismos IDs a las secciones correspondientes",
    "header-content_icon": "Componente o SVG para mostrar el icono en el header.",
    "header-styles_header": "Estilos para personalizar el contenedor principal del encabezado (header).",
    "header-styles_containerImg": "Estilos para el contenedor que agrupa el logo, optimizando su diseño visual.",
    "header-styles_img": "Estilos para modificar la apariencia de la imagen del logo.",
    "header-styles_nav": "Estilos personalizados para los enlaces en la barra de navegación (navbar).",
    "header-styles_icon": "Estilos para personalizar el contenedor de los iconos de la interfaz.",
    "header-children": "Utiliza la propiedad 'children' si necesitas personalizar completamente el contenido del encabezado (header). Esto reiniciará el contenido, pero mantendrá estilos base para conservar la estructura general.",

    "main-content_h1": "Texto del título principal de la sección (main).",
    "main-content_p": "Texto principal que se mostrará en la sección (main).",
    "main-content_path": "Enlace al que redirigirá el botón al hacer clic.",
    "main-content_button": "Texto que se mostrará dentro del botón.",
    "main-content_video": "URL de tipo 'embed' para mostrar un video en la sección.",
    "main-content_img": "Enlace a la imagen a mostrar, si decides no incluir un video.",
    "main-styles_main": "Estilos para personalizar el contenedor principal.",
    "main-styles_containerDescription": "Estilos para el contenedor que agrupa el h2, p y button.",
    "main-styles_h1": "Estilos específicos para el elemento h2.",
    "main-styles_p": "Estilos específicos para el elemento p.",
    "main-styles_button": "Estilos específicos para el button.",
    "main-styles_containerMedia": "Estilos para el contenedor de elementos multimedia.",
    "main-styles_video": "Estilos específicos para la opcion video.",
    "main-styles_img": "Estilos específicos para la opcion imagen.",

    "posts-content_h2": "Texto que se usará como título de la sección de publicaciones (posts).",
    "posts-content_posts": "Array que contiene objetos con la información para crear cada publicación. Debe contener más de 1 elemento para renderizarse.",
    "posts-_img": "URL o ruta de la imagen que se mostrará en la publicación.",
    "posts-_h3": "Título de la publicación dentro del objeto.",
    "posts-_p": "Texto o descripción de la publicación.",
    "posts-_path": "Enlace al que redireccionará la publicación cuando se haga clic.",
    "posts-_namePath": "Texto que se mostrará como el nombre del enlace en la publicación.",
    "posts-styles_posts": "Estilos para personalizar el contenedor principal de las publicaciones (posts).",
    "posts-styles_h2": "Estilos para el texto del título principal de la sección de publicaciones.",
    "posts-styles_grid": "Estilos para la cuadrícula (grid) que organiza las publicaciones.",
    "posts-styles_containerDescription": "Estilos para el contenedor que agrupa el contenido de cada publicación.",
    "posts-styles-_img": "Estilos para personalizar la apariencia de las imágenes de las publicaciones.",
    "posts-styles-_h3": "Estilos para el título individual de cada publicación.",
    "posts-styles-_p": "Estilos para el texto descriptivo de las publicaciones.",
    "posts-styles-_path": "Estilos para los enlaces dentro de las publicaciones.",

    "about-content_h2": "Texto que se usará como título de la sección About",
    "about-content_paragraphs": "Array de strings que conformarán los parrafos de la sección About.",
    "about-content_img": "URL o ruta de la imagen que se mostrará en la seccion About",
    "about-styles_containerDescription": "Estilos para personalizar el contenedor principal.",
    "about-styles_h2": "Estilos para personalizar el título de esta sección.",
    "about-styles_p": "Estilos específicos para los párrafos de esta sección.",
    "about-styles_img": "Estilos específicos para la imagen de esta sección.",

    "article-content_h2": "Texto que se usará como título principal de la sección Article.",
    "article-content_p": "Texto que servirá como descripción principal de la sección Article.",
    "article-content_img": "URL o ruta de la imagen que se mostrará en la sección Article.",
    "article-content_h3": "Texto que se usará como subtítulo dentro del contenido de artículo.",
    "aticle-content_text": "Texto que servirá como descripción dentro del contenido de artículo.",
    "article-styles_article": "Estilos para el contenedor principal de la sección Article.",
    "article-styles_containerDescription": "Estilos para el contenedor del título y la descripción principal.",
    "article-styles_h2": "Estilos específicos para el título principal (h2).",
    "article-styles_p": "Estilos específicos para los párrafos principales.",
    "article-styles_img": "Estilos para personalizar la imagen de la sección Article.",
    "article-styles_containerArticle": "Estilos para el contenedor del artículo secundario.",
    "article-styles_h3": "Estilos específicos para el subtítulo del artículo (h3).",
    "article-styles_text": "Estilos específicos para el párrafo del artículo secundario.",

    "contact-content_h2": "Título de la sección de redes sociales.",
    "contact-content_icons": "Array con objetos que incluyen iconos (JSX) y enlaces (path).",
    "contact-icons_path": "URL de redirección asociada a cada icono.",
    "contact-icons_icon": "Icono o SVG a mostrar.",
    "contact-content_h3": "Título para los campos de contacto.",
    "contact-content_placeholderA": "Placeholder para el primer input.",
    "contact-content_placeholderB": "Placeholder para el área de texto.",
    "contact-content_button": "Texto del botón de envío.",
    "contact-styles_contact": "Estilos del contenedor principal de la sección.",
    "contact-styles_h2": "Estilos para el título de redes sociales.",
    "contact-styles_containerIcons": "Estilos para el contenedor de los iconos.",
    "contact-styles_icon": "Estilos específicos para cada icono.",
    "contact-styles_containerInputs": "Estilos para el contenedor de los campos de contacto.",
    "contact-styles_h3": "Estilos para el título de los campos de contacto.",
    "contact-styles_input": "Estilos para el campo de input principal.",
    "contact-styles_textArea": "Estilos para el campo de área de texto.",
    "contact-styles_button": "Estilos para el botón de envío.",

    "footer-content_p": "Texto mostrado como contenido principal en el footer.",
    "footer-content_img": "URL o ruta de la imagen del logo en el footer.",
    "footer-styles_footer": "Estilos del contenedor principal del footer.",
    "footer-styles_containerDescription": "Estilos para el contenedor de la descripción completa.",
    "footer-styles_p": "Estilos para el texto dentro del footer.",
    "footer-styles_img": "Estilos para la imagen del logo en el footer."
  }
}
